## Plan Result (client-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11220814633)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.otel-collector-log-group
* Delete
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/ClientAPI-Prod/ecs/otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-clientapi"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "ClientAPI"
        }
      + tags_all          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-clientapi"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "ClientAPI"
        }
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod:524" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
                {
                    environment            = [
                        {
                            name  = "APOLLO_GRAPH_REF"
                            value = "pocket-client-api@current"
                        },
                        {
                            name  = "APP_ENVIRONMENT"
                            value = "production"
                        },
                        {
                            name  = "OTLP_COLLECTOR_HOST"
                            value = "localhost"
                        },
                        {
                            name  = "PORT"
                            value = "4001"
                        },
                        {
                            name  = "REDIS_ENDPOINT"
                            value = "clientapi-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                    ]
                    essential              = true
                    healthCheck            = {
                        command     = [
                            "CMD-SHELL",
                            "curl -f http://localhost:4001/.well-known/apollo/server-health || exit 1",
                        ]
                        interval    = 15
                        retries     = 3
                        startPeriod = 0
                        timeout     = 5
                    }
                    image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/clientapi-prod-app:latest"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group             = "/Backend/ClientAPI-Prod/ecs/app"
                            awslogs-multiline-pattern = "^\\S.+"
                            awslogs-region            = "us-east-1"
                            awslogs-stream-prefix     = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "app"
                    portMappings           = [
                        {
                            containerPort = 4001
                            hostPort      = 4001
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "APOLLO_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ClientAPI/Prod/APOLLO_KEY"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ClientAPI/Prod/SENTRY_DSN"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
              + {
                  + environment            = [
                      + {
                          + name  = "DEPLOYMENT_ENVIRONMENT_NAME"
                          + value = "prod"
                        },
                    ]
                  + essential              = true
                  + image                  = "pocket/opentelemetry-collector-contrib"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/ClientAPI-Prod/ecs/otel-collector"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "otel-collector"
                  + portMappings           = [
                      + {
                          + containerPort = 4138
                          + hostPort      = 4138
                          + protocol      = "tcp"
                        },
                      + {
                          + containerPort = 4137
                          + hostPort      = 4137
                          + protocol      = "tcp"
                        },
                      + {
                          + containerPort = 55681
                          + hostPort      = 55681
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + repositoryCredentials  = {
                      + credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  + secrets                = [
                      + {
                          + name      = "GOOGLE_APPLICATION_CREDENTIALS_JSON"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/GCP_SA_TRACES:::"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "ClientAPI-Prod" -> (known after apply)
      ~ revision                 = 524 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-clientapi"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "ClientAPI"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be destroyed
  # (because aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 is not in configuration)
  - resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
      - arn              = "arn:aws:iam::996905175585:policy/ClientAPI-Prod-TaskRolePolicy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::996905175585:policy/ClientAPI-Prod-TaskRolePolicy" -> null
      - name             = "ClientAPI-Prod-TaskRolePolicy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA6QHBNZIQWXU2PTH63" -> null
      - tags             = {
          - "app_code"       = "pocket-content-shared"
          - "component_code" = "pocket-content-shared-clientapi"
          - "costCenter"     = "Shared"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "ClientAPI"
        } -> null
      - tags_all         = {
          - "app_code"       = "pocket-content-shared"
          - "component_code" = "pocket-content-shared-clientapi"
          - "costCenter"     = "Shared"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "ClientAPI"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 will be destroyed
  # (because aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355" {
      - id         = "ClientAPI-Prod-TaskRole-20241007171942341600000001" -> null
      - policy_arn = "arn:aws:iam::996905175585:policy/ClientAPI-Prod-TaskRolePolicy" -> null
      - role       = "ClientAPI-Prod-TaskRole" -> null
    }

Plan: 2 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod:524" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":798,"Program":"tfcmt","SHA1":"16b2b6a6c6f6fc2d9eba3b1e3691afa96b9ca18f","Target":"client-api-cdk-production","Vars":{},"WorkflowName":"Client API"} -->